Revit 2027 API
RebarBendingDetailType.SchematicWidth Property
 Determine the width of the box where the schematic Bending Detail will be represented.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SchematicWidth { get; set; }
Public Property SchematicWidth As Double
	Get
	Set
public:
property double SchematicWidth {
	double get ();
	void set (double value);
}
member SchematicWidth : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for schematicWidth must be greater than 0 and no more than 30000 feet.
InvalidOperationException |  When setting this property:
See Also
Reference
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace